#### CurveExtents Members

---

|  |
| --- |
| CurveExtents Class   Methods   Properties   See Also |

The  CurveExtents  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  CurveExtents |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EndParameter | The end parameter of the curve extents. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | StartParameter | The start parameter of the curve extents. |

# See Also

CurveExtents Class

Autodesk.Revit.DB Namespace